<?xml version="1.0"?>
<net name="Model4" version="11">
	<layers>
		<layer id="0" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="self.embedding.weight" type="Const" version="opset1">
			<data element_type="u8" shape="32, 2" offset="0" size="64" />
			<output>
				<port id="0" precision="U8" names="self.embedding.weight">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module._nncf.external_op.weights_decompressor_embedding_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="39,input.1">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self._nncf.external_op.weights_decompressor_embedding_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="32, 1" offset="64" size="32" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_embedding_weight._zero_point">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module._nncf.external_op.weights_decompressor_embedding_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module._nncf.external_op.weights_decompressor_embedding_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="40">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self._nncf.external_op.weights_decompressor_embedding_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1" offset="96" size="64" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_embedding_weight._scale">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module._nncf.external_op.weights_decompressor_embedding_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="41">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module._nncf.external_op.weights_decompressor_embedding_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="42">
					<dim>32</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.embedding/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.embedding/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="160" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="11" name="__module.embedding/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="43">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="linear_0/aten::abs/Abs" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="94">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_6565" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="164" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="linear_0/aten::le/LessEqual" type="LessEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="95">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="linear_0/aten::masked_fill/ConvertLike" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="16" name="linear_0/aten::masked_fill/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="96">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="self.linear2.weight" type="Const" version="opset1">
			<data element_type="u8" shape="4, 2" offset="168" size="8" />
			<output>
				<port id="0" precision="U8" names="self.linear2.weight">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module._nncf.external_op.weights_decompressor_linear2_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="89,input">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="self._nncf.external_op.weights_decompressor_linear2_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="4, 1" offset="176" size="4" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_linear2_weight._zero_point">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module._nncf.external_op.weights_decompressor_linear2_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module._nncf.external_op.weights_decompressor_linear2_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="90">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self._nncf.external_op.weights_decompressor_linear2_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1" offset="180" size="8" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_linear2_weight._scale">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module._nncf.external_op.weights_decompressor_linear2_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="91">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module._nncf.external_op.weights_decompressor_linear2_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="92">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.linear2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="self.linear1.weight" type="Const" version="opset1">
			<data element_type="u8" shape="3, 2" offset="188" size="6" />
			<output>
				<port id="0" precision="U8" names="self.linear1.weight">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module._nncf.external_op.weights_decompressor_linear1_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="54,input.3">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="self._nncf.external_op.weights_decompressor_linear1_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="3, 1" offset="194" size="3" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_linear1_weight._zero_point">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module._nncf.external_op.weights_decompressor_linear1_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module._nncf.external_op.weights_decompressor_linear1_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="55">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="self._nncf.external_op.weights_decompressor_linear1_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="3, 1" offset="197" size="6" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_linear1_weight._scale">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module._nncf.external_op.weights_decompressor_linear1_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="56">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module._nncf.external_op.weights_decompressor_linear1_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="57">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.linear1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_6566" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 3" offset="203" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.linear1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="58">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="linear_0/aten::abs/Abs_1" type="Abs" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="75">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_6567" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="215" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="linear_0/aten::le/LessEqual_1" type="LessEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="76">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="linear_0/aten::masked_fill/ConvertLike_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="160" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="42" name="linear_0/aten::masked_fill/Select_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="77">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="self.linear3.weight" type="Const" version="opset1">
			<data element_type="u8" shape="5, 3" offset="219" size="15" />
			<output>
				<port id="0" precision="U8" names="self.linear3.weight">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module._nncf.external_op.weights_decompressor_linear3_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="70,input.5">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="self._nncf.external_op.weights_decompressor_linear3_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="5, 1" offset="234" size="5" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_linear3_weight._zero_point">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module._nncf.external_op.weights_decompressor_linear3_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module._nncf.external_op.weights_decompressor_linear3_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>5</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="71">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="self._nncf.external_op.weights_decompressor_linear3_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="5, 1" offset="239" size="10" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_linear3_weight._scale">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module._nncf.external_op.weights_decompressor_linear3_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>5</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>5</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="72">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module._nncf.external_op.weights_decompressor_linear3_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="73">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.linear3/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>5</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_6568" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 5" offset="249" size="20" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.linear3/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Result_5170" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5</dim>
				</port>
			</input>
		</layer>
		<layer id="26" name="Result_5169" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="35" to-port="0" />
		<edge from-layer="11" from-port="3" to-layer="16" to-port="2" />
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="3" to-layer="25" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0" />
		<edge from-layer="24" from-port="1" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="31" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="0" />
		<edge from-layer="30" from-port="1" to-layer="31" to-port="1" />
		<edge from-layer="31" from-port="2" to-layer="33" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="34" from-port="1" to-layer="35" to-port="1" />
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="42" to-port="2" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="38" from-port="1" to-layer="40" to-port="0" />
		<edge from-layer="39" from-port="0" to-layer="40" to-port="1" />
		<edge from-layer="40" from-port="2" to-layer="42" to-port="0" />
		<edge from-layer="41" from-port="0" to-layer="42" to-port="1" />
		<edge from-layer="42" from-port="3" to-layer="51" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="44" to-port="0" />
		<edge from-layer="44" from-port="1" to-layer="47" to-port="0" />
		<edge from-layer="45" from-port="0" to-layer="46" to-port="0" />
		<edge from-layer="46" from-port="1" to-layer="47" to-port="1" />
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1" />
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0" />
		<edge from-layer="50" from-port="1" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="53" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="54" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2024.1.0-15008-f4afc983258-releases/2024/1" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
