<?xml version="1.0"?>
<net name="Model124" version="11">
	<layers>
		<layer id="0" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="self.model.embed_tokens.weight" type="Const" version="opset1">
			<data element_type="u8" shape="32, 8" offset="0" size="256" />
			<output>
				<port id="0" precision="U8" names="self.model.embed_tokens.weight">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module._nncf.external_op.weights_decompressor_model_embed_tokens_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="107,input.1">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self._nncf.external_op.weights_decompressor_model_embed_tokens_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="32, 1" offset="256" size="32" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_model_embed_tokens_weight._zero_point">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module._nncf.external_op.weights_decompressor_model_embed_tokens_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module._nncf.external_op.weights_decompressor_model_embed_tokens_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="108">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="self._nncf.external_op.weights_decompressor_model_embed_tokens_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1" offset="288" size="64" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_model_embed_tokens_weight._scale">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module._nncf.external_op.weights_decompressor_model_embed_tokens_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="109">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module._nncf.external_op.weights_decompressor_model_embed_tokens_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="110">
					<dim>32</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.model.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.model.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="11" name="__module.model.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="111,144,155,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_258653" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="356" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_258651" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="360" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.layers.0.input_layernorm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="145">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_244902" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="364" size="8" />
			<output>
				<port id="0" precision="I64" names="146">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.layers.0.input_layernorm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="147">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_258652" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="372" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model.layers.0.input_layernorm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="148">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.model.layers.0.input_layernorm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="149">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="150,151,152,154">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.layers.0.self_attn.q_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="8, 8" offset="376" size="64" />
			<output>
				<port id="0" precision="U8" names="self.model.layers.0.self_attn.q_proj.weight">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="166,input.3">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="8, 1" offset="440" size="8" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight._zero_point">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="167">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="8, 1" offset="448" size="16" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight._scale">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="168">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_q_proj_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="169">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_259555" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="464" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="496" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="189,x.1">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.layers.0.self_attn.rotary_emb/aten::to/Convert_1" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2, 1" offset="512" size="8" />
			<output>
				<port id="0" precision="FP32" names="208,inv_freq_expanded.3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="89" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="520" size="8" />
			<output>
				<port id="0" precision="I64" names="89" />
			</output>
		</layer>
		<layer id="37" name="__module.model.layers.0.self_attn/aten::size/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_259263" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="528" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="39" name="Constant_259264" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="520" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="Gather_259265" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="112,114,118,120" />
			</output>
		</layer>
		<layer id="41" name="__module.model/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="536" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="42" name="__module.model/aten::arange/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="116,cache_position">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="117,204,433,position_ids">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="92" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="528" size="8" />
			<output>
				<port id="0" precision="I64" names="92" />
			</output>
		</layer>
		<layer id="45" name="__module.model.layers.0.self_attn.rotary_emb/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="205,206,207,209,434,435,436,438,position_ids_expanded,position_ids_expanded.1,position_ids_expanded.3,position_ids_expanded.5">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.layers.0.self_attn.rotary_emb/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210,439">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="540" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.layers.0.self_attn.rotary_emb/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="211,440">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.model.layers.0.self_attn.rotary_emb/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="213,442">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.layers.0.self_attn.rotary_emb/aten::cos/Cos" type="Cos" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="214,216,219,443,445,448">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="221,450">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.layers.0.self_attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="223">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_3" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="84" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="552" size="8" />
			<output>
				<port id="0" precision="I64" names="84" />
			</output>
		</layer>
		<layer id="55" name="__module.model.layers.0.self_attn/aten::size/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="56" name="__module.model.layers.0.self_attn/aten::size/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="224,229" />
			</output>
		</layer>
		<layer id="57" name="Constant_244745" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="560" size="8" />
			<output>
				<port id="0" precision="I64" names="82" />
			</output>
		</layer>
		<layer id="58" name="__module.model.layers.0.self_attn/aten::floor_divide/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="59" name="__module.model.layers.0.self_attn/aten::floor_divide/Floor_1" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="226,227,231,232" />
			</output>
		</layer>
		<layer id="60" name="Constant_259267" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_259268" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.layers.0.self_attn/aten::slice/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.layers.0.self_attn/aten::slice/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.layers.0.self_attn/aten::slice/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.layers.0.self_attn/aten::slice/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="233">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_258654" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="576" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.layers.0.self_attn/aten::neg/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="234">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.layers.0.self_attn/aten::slice/Reshape_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.layers.0.self_attn/aten::slice/Reshape_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.model.layers.0.self_attn/aten::slice/Reshape_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.model.layers.0.self_attn/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="228">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.layers.0.self_attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="236">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.layers.0.self_attn.rotary_emb/aten::sin/Sin" type="Sin" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="215,217,220,444,446,449">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="222,451">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.layers.0.self_attn/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="237">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.layers.0.self_attn/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="238">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="self.model.layers.0.self_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="4, 8" offset="580" size="32" />
			<output>
				<port id="0" precision="U8" names="self.model.layers.0.self_attn.k_proj.weight">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16" names="174,input.5">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight._zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="4, 1" offset="612" size="4" />
			<output>
				<port id="0" precision="U8" names="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight._zero_point">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight/aten::sub/Convert" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="175">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight._scale" type="Const" version="opset1">
			<data element_type="f16" shape="4, 1" offset="616" size="8" />
			<output>
				<port id="0" precision="FP16" names="self._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight._scale">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="176">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module._nncf.external_op.weights_decompressor_model_layers_0_self_attn_k_proj_weight/aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="177">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model.layers.0.self_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="178">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_259556" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="624" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_258300" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="656" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.layers.0.self_attn/aten::transpose/Transpose_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="192,x.3">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.layers.0.self_attn/aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="239">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_5" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.layers.0.self_attn/aten::size/Constant_5" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="93" name="__module.model.layers.0.self_attn/aten::size/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="240,245" />
			</output>
		</layer>
		<layer id="94" name="__module.model.layers.0.self_attn/aten::floor_divide/Divide_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="95" name="__module.model.layers.0.self_attn/aten::floor_divide/Floor_3" type="Floor" version="opset1">
			<input>
				<port id="0" precision="I64" />
			</input>
			<output>
				<port id="1" precision="I64" names="242,243,247,248" />
			</output>
		</layer>
		<layer id="96" name="Constant_259221" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Reshape_259222" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.model.layers.0.self_attn/aten::slice/Reshape_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="__module.model.layers.0.self_attn/aten::slice/Reshape_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.model.layers.0.self_attn/aten::slice/Reshape_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.model.layers.0.self_attn/aten::slice/Slice_2" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="249">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_258655" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="576" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.layers.0.self_attn/aten::neg/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="250">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.layers.0.self_attn/aten::slice/Reshape_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.layers.0.self_attn/aten::slice/Reshape_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.layers.0.self_attn/aten::slice/Reshape_15" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.layers.0.self_attn/aten::slice/Slice_3" type="Slice" version="opset8">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="244">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.layers.0.self_attn/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="252">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.layers.0.self_attn/aten::mul/Multiply_3" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="253">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.layers.0.self_attn/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="254,260,261,hidden_states.1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="86" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="560" size="8" />
			<output>
				<port id="0" precision="I64" names="86" />
			</output>
		</layer>
		<layer id="112" name="__module.model.layers.0.self_attn/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="262,263,264">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_259309" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="520" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_259310" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="520" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="115" name="Gather_259311" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="136,255,271,484,500">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.layers.0.self_attn/aten::size/ShapeOf_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_259662" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="528" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.layers.0.self_attn/aten::size/Constant_7" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="352" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="119" name="__module.model.layers.0.self_attn/aten::size/Gather_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="256">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_257037" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="560" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_257651" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="688" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_257652" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="520" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="123" name="Gather_257653" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.layers.0.self_attn/prim::ListConstruct/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="265">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.layers.0.self_attn/aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="266">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_259557" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="704" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.layers.0.self_attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="270,key_states.1">
					<dim>-1</dim>
					<dim>2</dim>
